In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("titanic.csv")

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df.iloc [99]

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                         34.0
SibSp                          1
Parch                          0
Ticket                    244367
Fare                        26.0
Cabin                        NaN
Embarked                       S
Name: 99, dtype: object

In [7]:
df.iloc [17]

PassengerId                              18
Survived                                  1
Pclass                                    2
Name           Williams, Mr. Charles Eugene
Sex                                    male
Age                                     NaN
SibSp                                     0
Parch                                     0
Ticket                               244373
Fare                                   13.0
Cabin                                   NaN
Embarked                                  S
Name: 17, dtype: object

In [8]:
df.iloc [5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [9]:
df.loc[[5],'Age'] = 25

In [10]:
df.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                        25.0
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [11]:
agefilter = df[df['Age'] > 18]
print (agefilter)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
885          886         0       3
886          887         0       2
887          888         1       1
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
885      5            382652  29.1250   NaN        Q
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[576 rows x 12 columns]

In [12]:
count = 0
for person in df["Age"]:
    if person > 18:
        count = count + 1
count

576

In [13]:
count = (df['Age'] > 18).sum()
count

576

In [14]:
count = 0
for person in df['Sex']:
    if person == 'male':
        count = count + 1
count = (count / len(df)) * 100
count

64.75869809203144

In [15]:
count = 0
for person in df['Survived']:
    if person == 1:
        count +=1
count = (count / len(df)) * 100
count

38.38383838383838

In [16]:
count = 0
for person in df['Pclass']:
    if person == 1:
        count +=1
count = (count / len(df)) * 100
count

24.242424242424242

In [17]:
num_rows = df.shape[0]
num_rows

891

In [18]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [19]:
'''
frequency_table = df.value_counts('Ticket')
print (frequency_table)
'''
classes = {"CLASS":[], "Frequency":[]}
countFirst = 0
countSecond = 0
countThird = 0
for ticket in df["Pclass"]:
    if ticket == 1:
        countFirst +=1
    elif ticket == 2:
        countSecond +=1
    elif ticket == 3:
        countThird +=1
classes['CLASS'].append('First')
classes['CLASS'].append('Second')
classes['CLASS'].append('Third')
classes['Frequency'].append(countFirst)
classes['Frequency'].append(countSecond)
classes['Frequency'].append(countThird)
classes

{'CLASS': ['First', 'Second', 'Third'], 'Frequency': [216, 184, 491]}

In [20]:
frequency_table_percentages = df['Embarked'].value_counts(normalize=True) * 100
frequency_table_percentages

Embarked
S    72.440945
C    18.897638
Q     8.661417
Name: proportion, dtype: float64

In [21]:
df.iloc [527]

PassengerId                   528
Survived                        0
Pclass                          1
Name           Farthing, Mr. John
Sex                          male
Age                           NaN
SibSp                           0
Parch                           0
Ticket                   PC 17483
Fare                     221.7792
Cabin                         C95
Embarked                        S
Name: 527, dtype: object

In [22]:
ID528 = df.loc [[528], "PassengerID"] = 528
ID528

528

In [23]:
df[df['PassengerID'] == 528]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,PassengerID
528,529,0,3,"Salonen, Mr. Johan Werner",male,39.0,0,0,3101296,7.925,NaN,S,528.0

In [24]:
'''df[df['Name'] == 'Fannie']'''
idx = 0
for person in df['Name']:
    if 'Fannie' in person:
        break
    idx += 1
df.loc[idx]

PassengerId                              707
Survived                                   1
Pclass                                     2
Name           Kelly, Mrs. Florence "Fannie"
Sex                                   female
Age                                     45.0
SibSp                                      0
Parch                                      0
Ticket                                223596
Fare                                    13.5
Cabin                                    NaN
Embarked                                   S
PassengerID                              NaN
Name: 706, dtype: object

In [25]:
Gender = 'Sex'
Survival = 'Survived'
contingency_table = pd.crosstab(df['Sex'],df['Survived'], margins = True)
contingency_table

Survived    0    1  All
Sex
female     81  233  314
male      468  109  577
All       549  342  891

In [26]:
maleSurvive = 0
femaleSurvive = 0
maleDied = 0
femaleDied = 0
for idx in range(len(df)):
    if df.loc[idx]['Sex'] == 'male' and df.loc[idx]['Survived'] == 0:
        maleDied += 1
    elif df.loc[idx]['Sex'] == 'male' and df.loc[idx]['Survived'] == 1:
        maleSurvive += 1
    elif df.loc[idx]['Sex'] == 'female' and df.loc[idx]['Survived'] == 0:
        femaleDied += 1
    elif df.loc[idx]['Sex'] == 'female' and df.loc[idx]['Survived'] == 1:
        femaleSurvive += 1
conTable2 = pd.DataFrame ({
    'Male': [maleSurvive, maleDied],
    'Female': [femaleSurvive, femaleDied]
})
conTable2.index = ['Survived', 'Died']
conTable2.head()

          Male  Female
Survived   109     233
Died       468      81

In [27]:
MinorSurvive = 0
AdultSurvive = 0
MinorDied = 0
AdultDied = 0
for idx in range(len(df)):
    if df.loc[idx]['Age'] < 18 and df.loc[idx]['Survived'] == 0:
        MinorDied += 1
    elif df.loc[idx]['Age'] < 18 and df.loc[idx]['Survived'] == 1:
        MinorSurvive += 1
    elif df.loc[idx]['Age'] >= 18 and df.loc[idx]['Survived'] == 0:
        AdultDied += 1
    elif df.loc[idx]['Age'] >= 18 and df.loc[idx]['Survived'] == 1:
        AdultSurvive += 1
conTable = pd.DataFrame ({
    'Minor': [MinorSurvive, MinorDied],
    'Adult': [AdultSurvive, AdultDied]
})
conTable.index = ['Survived', 'Died']
conTable.head()

          Minor  Adult
Survived     61    229
Died         52    373

In [28]:
total = conTable.sum()
RconTable = conTable / total * 100
RconTable

              Minor      Adult
Survived  53.982301  38.039867
Died      46.017699  61.960133

In [58]:
sSurvive = 0
qSurvive = 0
cSurvive = 0
sDied = 0
qDied = 0
cDied = 0
for idx in range(len(df)):
    if df.loc[idx]['Embarked'] == 'S' and df.loc[idx]['Survived'] == 0:
        sDied += 1
    elif df.loc[idx]['Embarked'] == 'S' and df.loc[idx]['Survived'] == 1:
        sSurvive += 1
    elif df.loc[idx]['Embarked'] == 'Q' and df.loc[idx]['Survived'] == 0:
        qDied += 1
    elif df.loc[idx]['Embarked'] == 'Q' and df.loc[idx]['Survived'] == 1:
        qSurvive += 1
    elif df.loc[idx]['Embarked'] == 'C' and df.loc[idx]['Survived'] == 1:
        cSurvive += 1
    elif df.loc[idx]['Embarked'] == 'C' and df.loc[idx]['Survived'] == 0:
        cDied += 1
conTable3 = pd.DataFrame ({
    'Southampton': [sSurvive, sDied],
    'Queenstown': [qSurvive, qDied],
    'Cherbourg': [cSurvive, cDied]
})
conTable3.index = ['Survived', 'Died']
conTable3.head()

          Southampton  Queenstown  Cherbourg
Survived          217          30         93
Died              427          47         75

In [62]:
total = conTable3.sum()
RconTable2 = conTable3 / total * 100
RconTable2

          Southampton  Queenstown  Cherbourg
Survived    33.695652   38.961039  55.357143
Died        66.304348   61.038961  44.642857